Repository: 20centaurifux/gsasl
Catalog: lib/po/*.po
Languages: vi

source: Libgsasl success
vi: Libgsasl thành công

source: SASL mechanism needs more data
vi: Cơ cấu SASL cần thiết dữ liệu thêm

source: Unknown SASL mechanism
vi: Gặp cơ cấu SASL lạ

source: SASL mechanism called too many times
vi: Đã gọi cơ cấu SASL quá nhiều lần

source: Memory allocation error in SASL library
vi: Lỗi cấp phát bộ nhớ trong thư viện SASL

source: Base 64 coding error in SASL library
vi: Lỗi mã cơ số 64 trong thư viện SASL

source: Low-level crypto error in SASL library
vi: Lỗi mã hóa mức thập trong thư viện SASL

source: GSSAPI library could not deallocate memory in gss_release_buffer() in SASL library. This is a serious internal error.
vi: Thư viện GSSAPI không thể bỏ cấp phát bộ nhớ trong bộ đệm « gss_release_buffer() » trong thư viện SASL. Đây là lỗi nội bộ nghiêm trọng.

source: GSSAPI library could not understand a peer name in gss_import_name() in SASL library. This may be due to incorrect user supplied data.
vi: Thư viện GSSAPI không thể hiểu một tên ngang hàng trong « gss_import_name() » trong thư viện SASL. Có thể vì người dùng cung cấp dữ liệu không đúng.

source: GSSAPI error in client while negotiating security context in gss_init_sec_context() in SASL library. This is most likely due insufficient credentials or malicious interactions.
vi: Gặp lỗi GSSAPI trong ứng dụng khách khi thuơng lượng ngữ cảnh bảo mật trong « gss_init_sec_context() » trong thư viện SASL. Chắc vì chưa có đủ thông tin xác thức hay có sự tương tác hiểm độc.

source: GSSAPI error in server while negotiating security context in gss_init_sec_context() in SASL library. This is most likely due insufficient credentials or malicious interactions.
vi: Gặp lỗi GSSAPI trong máy phục vụ khi thương lượng ngữ cảnh bảo mật trong « gss_init_sec_context() » trong thư viện SASL. Chắc vì chưa có đủ thông tin xác thức hay có sự tương tác hiểm độc.

source: GSSAPI error while decrypting or decoding data in gss_unwrap() in SASL library. This is most likely due to data corruption.
vi: Gặp lỗi GSSAPI khi giải mã hoặc giải mật mã dữ liệu trong « gss_unwrap() » trong thư viện SASL. Chắc vì dữ liệu bị hỏng.

source: GSSAPI error while encrypting or encoding data in gss_wrap() in SASL library.
vi: Gặp lỗi GSSAPI khi mã hóa hoặc mật mã hóa dữ liệu trong « gss_wrap() » trong thư viện SASL.

source: GSSAPI error acquiring credentials in gss_acquire_cred() in SASL library. This is most likely due to not having the proper Kerberos key available in /etc/krb5.keytab on the server.
vi: Gặp lỗi GSSAPI khi gọi thông tin xác thức trong « gss_acquire_cred() » trong thư viện SASL. Chắc vì không có khóa Kerberos đúng sẵn sàng trong </etc/krb5.keytab> trên máy phục vụ.

source: GSSAPI error creating a display name denoting the client in gss_display_name() in SASL library. This is probably because the client supplied bad data.
vi: Gặp lỗi GSSAPI khi tạo tên hiển thị đối với ứng dụng khách trong « gss_display_name() » trong thư viện SASL. Chắc vì ứng dụng khách cung cấp dữ liệu sai.

source: Other entity requested integrity or confidentiality protection in GSSAPI mechanism but this is currently not implemented.
vi: Đối thể khác yêu cầu bảo vệ sự tích hợp hay bí mật trong cơ cấu GSSAPI nhưng khả năng này chưa được thi hành.

source: SASL mechanism could not parse input
vi: Cơ cấu SASL không thể phân tách dữ liệu nhập

source: Error authenticating user
vi: Gặp lỗi khi xác thức người dùng

source: Integrity error in application payload
vi: Gặp lỗi sự tích hợp trong trọng tải ứng dụng

source: Client-side functionality not available in library (application error)
vi: Khả năng bên ứng dụng khách không sẵn sàng trong thư viện (lỗi ứng dụng)

source: Server-side functionality not available in library (application error)
vi: Khả năng bên máy phục vụ không sẵn sàng trong thư viện (lỗi ứng dụng)

source: No callback specified by caller (application error).
vi: Điều gọi chưa ghi rõ cách trở lại (lỗi ứng dụng).

source: Authentication failed because the anonymous token was not provided.
vi: Không xác thức được vì chưa cung cấp hiệu bài vô danh.

source: Authentication failed because the authentication identity was not provided.
vi: Không xác thức được vì không cung cấp thông tin nhận diện để xác thức.

source: Authentication failed because the authorization identity was not provided.
vi: Không xác thức được vì không cung cấp thông tin nhận diện để xác thức.

source: Authentication failed because the password was not provided.
vi: Không xác thức được vì không cung cấp mật khẩu.

source: Authentication failed because the passcode was not provided.
vi: Không xác thức được vì không cung cấp mã mật khẩu.

source: Authentication failed because the pin code was not provided.
vi: Không xác thức được vì không cung cấp mã PIN (số nhận diện cá nhân).

source: Authentication failed because the service name was not provided.
vi: Không xác thức được vì không cung cấp tên dịch vụ.

source: Authentication failed because the host name was not provided.
vi: Không xác thức được vì không cung cấp tên máy.

source: Could not prepare internationalized (non-ASCII) string.
vi: Không thể chuẩn bị chuỗi đã quốc tế hóa (không ASCII).

source: SASL function needs larger buffer (internal error)
vi: Chức năng SASL cần bộ đệm lớn hơn (lỗi nội bộ)

source: Could not open file in SASL library
vi: Không mở được tập tin trong thư viện SASL

source: Could not close file in SASL library
vi: Không đóng được tập tin trong thư viện SASL

source: Cannot get internal library handle (library error)
vi: Không gọi được điều quản lý thư viện nội bộ (lỗi thư viện)

source: SASL mechanism needs gsasl_client_callback_anonymous() callback (application error)
vi: Cơ cấu SASL cần khả nang gọi trở lại dạng « gsasl_client_callback_anonymous() » [khách gọi trở lại vô danh] (lỗi ứng dụng)

source: SASL mechanism needs gsasl_client_callback_password() callback (application error)
vi: Cơ cấu SASL cần khả nang gọi trở lại dạng « gsasl_client_callback_password() » [khách gọi trở lại mật khẩu] (lỗi ứng dụng)

source: SASL mechanism needs gsasl_client_callback_passcode() callback (application error)
vi: Cơ cấu SASL cần khả nang gọi trở lại dạng gsasl_client_callback_passcode() [khách gọi trở lại mã mật khẩu] (lỗi ứng dụng)

source: SASL mechanism needs gsasl_client_callback_pin() callback (application error)
vi: Cơ cấu SASL cần khả nang gọi trở lại dạng « gsasl_client_callback_pin() » [khách gọi trở lại số nhận diện cá nhân] (lỗi ứng dụng)

source: SASL mechanism needs gsasl_client_callback_authorization_id() callback (application error)
vi: Cơ cấu SASL cần khả nang gọi trở lại dạng « gsasl_client_callback_authorization_id() » [khách gọi trở lại thông tin nhận diện được phép] (lỗi ứng dụng)

source: SASL mechanism needs gsasl_client_callback_authentication_id() callback (application error)
vi: Cơ cấu SASL cần khả nang gọi trở lại dạng « gsasl_client_callback_authentication_id() » [khách gọi trở lại thông tin nhận diện xác thực] (lỗi ứng dụng)

source: SASL mechanism needs gsasl_client_callback_service() callback (application error)
vi: Cơ cấu SASL cần khả nang gọi trở lại dạng « gsasl_client_callback_service() » [khách gọi trở lại dịch vụ] (lỗi ứng dụng)

source: SASL mechanism needs gsasl_server_callback_validate() callback (application error)
vi: Cơ cấu SASL cần khả nang gọi trở lại dạng « gsasl_server_callback_validate() » [khách gọi trở lại hợp lệ hóa] (lỗi ứng dụng)

source: SASL mechanism needs gsasl_server_callback_cram_md5() callback (application error)
vi: Cơ cấu SASL cần khả nang gọi trở lại dạng « gsasl_server_callback_cram_md5() » (lỗi ứng dụng)

source: SASL mechanism needs gsasl_server_callback_digest_md5() callback (application error)
vi: Cơ cấu SASL cần khả nang gọi trở lại dạng « gsasl_server_callback_digest_md5() » (lỗi ứng dụng)

source: SASL mechanism needs gsasl_server_callback_anonymous() callback (application error)
vi: Cơ cấu SASL cần khả nang gọi trở lại dạng « gsasl_server_callback_anonymous() » [máy phục vụ gọi trở lại vô danh] (lỗi ứng dụng)

source: SASL mechanism needs gsasl_server_callback_external() callback (application error)
vi: Cơ cấu SASL cần khả nang gọi trở lại dạng « gsasl_server_callback_external() » [máy phục vụ gọi trở lại bên ngoài] (lỗi ứng dụng)

source: SASL mechanism needs gsasl_server_callback_realm() callback (application error)
vi: Cơ cấu SASL cần khả nang gọi trở lại dạng « gsasl_server_callback_realm() » [máy phục vụ gọi trở lại địa hạt] (lỗi ứng dụng)

source: SASL mechanism needs gsasl_server_callback_securid() callback (application error)
vi: Cơ cấu SASL cần khả nang gọi trở lại dạng « gsasl_server_callback_securid() » [máy phục vụ gọi trở lại thông tin nhận diện bảo mật] (lỗi ứng dụng)

source: SASL mechanism needs gsasl_server_callback_service() callback (application error)
vi: Cơ cấu SASL cần khả nang gọi trở lại dạng « gsasl_server_callback_service() » [máy phục vụ gọi trở lại dịch vụ] (lỗi ứng dụng)

source: SASL mechanism needs gsasl_server_callback_gssapi() callback (application error)
vi: Cơ cấu SASL cần khả nang gọi trở lại dạng « gsasl_server_callback_gssapi() » (lỗi ứng dụng)

source: SASL mechanism needs gsasl_server_callback_retrieve() callback (application error)
vi: Cơ cấu SASL cần khả nang gọi trở lại dạng « gsasl_server_callback_retrieve() » [máy phục vụ gọi trở lại lấy] (lỗi ứng dụng)

source: Failed to perform Unicode Normalization on string.
vi: Không tiêu chuẩn hoá dạng Unicode chuỗi.

source: No more realms available (non-fatal)
vi: Không còn có địa hạt sẵn sàng lại (không nghiêm trọng)

source: The provided library handle was invalid (application error)
vi: Điều quản lý thư viện đã cho là không hợp lệ (lỗi ứng dụng)

source: Libgsasl unknown error
vi: Gặp lỗi Libgsasl lạ
