Repository: 20centaurifux/gsasl
Catalog: po/*.po
Languages: ro

source: Chose SASL mechanism:
ro: Alegeþi mecanismul SASL:

source: Input SASL mechanism supported by server:
ro: Introduceþi mecanismul SASL suportat de server:

source: Using mechanism:
ro: Folosind mecanismul:

source: Output from client:
ro: Ieºirea de la client:

source: Output from server:
ro: Ieºirea de la server:

source: This client supports the following mechanisms:
ro: Acest client suportã urmãtoarele mecanisme:

source: This server supports the following mechanisms:
ro: Acest server suportã urmãtoarele mecanisme:

source: Cannot find mechanism...
ro: Nu pot gãsi mecanismul...

source: Enter base64 authentication data from server (press RET if none):
ro: Introduceþi datele de autentificare base64 de la server (apãsaþi RET dacã nu existã):

source: Enter base64 authentication data from client (press RET if none):
ro: Introduceþi datele de autentificare base64 de la client (apãsaþi RET dacã nu existã):

source: Client authentication finished (server trusted)...
ro: Autentificarea clientului a fost terminatã (server de încredere)...

source: Server authentication finished (client trusted)...
ro: Autentificarea clientului a fost terminatã (client de încredere)...

source: Enter application data (EOF to finish):
ro: Introduceþi datele aplicaþiei (EOF pentru a termina):

source: Base64 encoded application data to send:
ro: Datele aplicaþiei encodate Base64 de trimis:

source: Session finished...
ro: Sesiune terminatã...
